% instructions for `start`

:- dynamic is_outside/0, at_introduction/0, can_see/1, can_answer/2, answered/3, spojrz/1, odpowiedz/2.

instructions :-
    tty_clear,
    write('░▒▓███████▓▒░ ░▒▓██████▓▒░ ░▒▓██████▓▒░ ░▒▓██████▓▒░        ░▒▓██████▓▒░ ░▒▓██████▓▒░░▒▓██████████████▓▒░░▒▓████████▓▒░ '), nl,
    write('░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        '), nl,
    write('░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        '), nl,
    write('░▒▓███████▓▒░░▒▓████████▓▒░▒▓█▓▒░      ░▒▓████████▓▒░      ░▒▓█▓▒▒▓███▓▒░▒▓████████▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓██████▓▒░   '), nl,
    write('░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        '), nl,
    write('░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░      ░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░        '), nl,
    write('░▒▓███████▓▒░░▒▓█▓▒░░▒▓█▓▒░░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░       ░▒▓██████▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓█▓▒░░▒▓█▓▒░░▒▓█▓▒░▒▓████████▓▒░ '), nl,
    nl,
    write('Dostepne polecenia:'), nl,
    write('\tstart.                                 -- rozpocznij gre'), nl,
    write('\tspojrz(cel).                           -- spojrz na obiekt/postac'), nl,
    write('\todpowiedz(cel, p/f/w/t/n)., nl.        -- odpowiedz na pytanie (otwarte: p/f/w, zamknięte: t/n)'), nl.
    % ...
    % add command help here

introduction :-
        assert(at_introduction),
        assert(is_outside),
        nl,
        write('Była to zimna grudniowa noc, wybrałeś się w Tatry...'), nl,
        write('Po 5 godzinach wchodzenia pod górę, wreszcie widzisz przed sobą \e[1mschronisko\e[0m'), nl, nl,
        write('(TIP: Spróbuj \e[1mspojrzeć\e[0m na \e[1mschronisko\e[0m)'),
        assert(can_see(schronisko)),
        !, nl.

start :-
    instructions,
    introduction.

% general see rule
spojrz(X) :-
    tty_clear,
    \+ can_see(X),
    write('Nie masz możliwości teraz tego zobaczyć.'), nl,
    write('Hint: pamiętaj, żeby nazwy obiektów wpisywać bez polskich znaków'), !, nl.

% POCZĄTEK GRY
spojrz(schronisko) :-
    is_outside,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░░░░░░░░░'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▓█████████████▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▒▒▒▓▓▒▒▒▓▓▓▒▓████████████████▓▓▓▓▒▒▒▒▓▒▒▓▓▓██▓▒▒▒▒'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▒▒▒▒▒▒▓▓▓▓▓▓▓██████▒▒▒▒▓▓▒▒▒▓▓▓▓▓██████████████████████████████████'), nl,
    write('▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█▓████▓▓▒▓█████████▓▓██▓▓▒▒▓████▓▓▓██▓▒▒█████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓████▓▓▒▒▓████████▓████▓▒▓▒█████▓████▓▓▒▒▒██▓█████████████████████████'), nl,
    write('▓▓▓█▓██▓███████████████████▓███▓▓▓▒▒▓▓███████▓▓███▓▓███▓▓███▒██████▓▓▓▓▓▓▓██████████████████████████'), nl,
    write('██████▓████████████████▓▓█▓▓▓▓██▓▓▓▓▓▓█████▓████▓██████████▓▓█████▓▒▓▓▓▓▓▓▓█████████████████▓▓▒▓▓▒▒▒'), nl,
    write('███████████████████████▓▒▓▓█▓█▓▓▓▓▓▓▓█████▓█▓▒▓███████████▓▒██████▓▓█▓▓█▓▓▓█▓████████▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('█████████████████████▒▓▓▓█▓▓▓▓▓▓▓▓▓▓██████▓▓▓███▓███▓████████████▓▓▓█████▓█▓▓▓███████████▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('█████████████████▓▓▓▓▓▓██▓▓▓▓▓▓▓▓▓▓▓████▓▓███▓▓█▓▓▓██████████████▓▓▓███████████████████████▓▒▒▒▒▒▒▒▒'), nl,
    write('██████████████████████████▓▓▓▓▓▓█▓▓ ░░▒▒▒▓▓▓▓▓▓▓█▓█████████████████▓▓███▓▓█████████▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('█████████████████████▓▓███████▓▓▓░                 ▒▓██████████████▓█████▓▓▓▓███▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░'), nl,
    write('████████████████▒███████▓██▓▓▓▓▓                  ▓░░▒██████████████▓████████▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░   '), nl,
    write('███████████████████▓██████████░                  ▒▒░░░░▓█████████████████▓▓▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▒▒▒░    ░'), nl,
    write('█████████████████████████████                  ▓▒▒▒▒▒░░░▒███████████████▓█▒▒▒▒▒▒▒▒▒▒▒░▒▒░░▒▒░    ░  '), nl,
    write('█▓▒▓██████████████▓▓███████░                  ▓▒▒▒░░▒▒░░░░▓█████████████████▓▒▒▒░▒▒░▒▒░░░░░░ ░░     '), nl,
    write('▓▓▒█████████████████▒▒▒███                  ░▓▒▒▒▒▒▒▒▒▒▒░░░▒████████████▓██▓██▓▒▒▒░░▒▒▒  ░░░▒░      '), nl,
    write('█▒▓█████████▒░█████▒░███▒                  ▒▓▒▒▒▒▓▒▒▒▒▒▒▒░░░░▓██████████▓▓▒▓▓░▒▓▓▓▒░░░░▒░░░░▒░░ ░ ░░'), nl,
    write('█████████▒██▓▓▒▒▒▓▒▒███▒                  █▓▓▒▒▒▒▒▒▒▓▒▒▒▒▒▒░░░▒████▒██████▓░▒▓▓▓▓▓░░░░░░░ ░░░  ░░  ░'), nl,
    write('███████████▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒              ▓▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████████▒▒▓▒▒░░ ░▒░▒▓░▒░░ ▒░░░   '), nl,
    write('█████████████▓▓▓▓▓▒▓▒▒▒▒▒▒▒░░░▒        ▒▒▒▓▓▒▒▒▒▒▒▒▒▒▒▒▓░░▒▓▓█░░░░░░░░ ▒▓█▒ ░█░ ░░░░░░▒▒      ░     '), nl,
    write('███████████████▓▓▓▓▓▒▒▒▒▒▒▒░░░░░░▒░   ▓▓▒▒▒▒▒▒▒▓▓▒▒▒░░░  ░▒▒░░░░░░░░░░░░▒░   ░  ▓░░ ▒▒ ▒   ░░       '), nl,
    write('██████████████████▓▓▒▒░░▒▒▒ ░░░░░░░▓▒▒▒▒▒▒░     ░▒▒▒     ░▒▒░  ▒▒░░░░░▒▓▓       ░ ▒ ▒▓ ▒░  ░░       '), nl,
    write('██████████████████████▒▒▒▒▒     ▒ ░▓▒▒░▒▒█ ░░░   ▒▒██████▓▒▒▒▓█░░    ▓░▓▓▒▒▒░ ░░    ▒▓ ▒   ░░       '), nl,
    write('█████████████████████████▓▒▒ ░░ ░ ░▓▒▒▒░░█▓   ░██▓███████████▓▒▒▓▒▒▒░▒▒▒░░▒▓▓▒▓▓░░ █▓▒░░            '), nl,
    write('████████████████████████████▓▓▓░░  ▒░░▒░░▒▒░░▓▓▒▒▓▓█████████▓▓█████▓▓▓░▒░░▒▒▒   ░░██▓▓█████████▓▒   '), nl,
    write('███████████████████████████████▓▒▒░▒░░░ ▒▓░▓██▒██▓██████████▓█▓▓▓████▒▓▓▒█████████████████████████▓▓'), nl,
    write('███████████████████████████████████░░░▒ ▒▓▓▒████████▓▓▓███▓▓▓▓██▓██▓▓▓▓▓▓▓▓███████████████▓█████████'), nl,
    write('██████████████████████████████████████▒▒▒▓▓███▓███▓▓▓▓█▓▓▓▓▓███▓███▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████████████▓▓█▓'), nl,
    write('██████████████████████████████████████████████████▓▓█▓▓▓█▓███▓▓█████▓▓▓▓▓▓▓█▓▓█▓█▓█▓▓██████████████▓'), nl,
    write('███████████████████████████████████████████████████▓██▓█████▓█▓▓▓███▓▓█▓██▓▓███▓▓█▓▓▓▓███▓█▓█████▓▓█'), nl,
    write('█████████████████████████████████████████████████████████▓█▓▓▓█████▓██▓██▓█▓█▓▓▓███▓▓▓█▓▓██▓▓█▓█████'), nl, nl,
    write('Z komina schroniska wydobywa się ledwo widoczny dym.'),
    write('Baca chyba zainwestował w eko-drewno'), nl,
    write('...albo gmina go zmusiła. Uznajesz, że nie ma czasu do stracenia, ładujesz się do środka'), nl, nl,
    retract(is_outside),
    fail.

spojrz(schronisko) :-
    write('Od razu po wejściu do schroniska czujesz silną woń kompotu, przed sobą dostrzegasz duży \e[1mstół\e[0m.'), nl,
    write('obok stołu znajduje się ceglany \e[1mkominek\e[0m. Przed kominkiem, na bujanym fotelu siedzi starszy \e[1mmężczyzna\e[0m'), nl,
    write('Po drugiej stronie stołu znajduje się \e[1mokieno\e[0m, które najpewniej jest recepcją oraz miejscem, z którego'), nl,
    write('przez cały dzień można pobierać ciepłe posiłki.'), nl, nl,
    write('TIP: Możesz \e[1mspojrzeć\e[0m na pogrubione obiekty.'),
    assert(can_see(stol)),
    assert(can_see(kominek)),
    assert(can_see(okienko)),
    assert(can_see(mezczyzna)),
    !, nl.

% TUTORIAL ODPOWIADANIA
spojrz(stol) :-
    write('stół jest zrobiony z silnego drewna, wygląda na lokalny wytwór. Nigdy wcześniej takiego nie widziałeś.'), nl,
    answered(mezczyzna, sznupanie, _), !, nl.

spojrz(stol) :-
    write('"co tam tak sznupiesz, mody?" - słyszysz głos [mężczyzny] na krześle'), nl, nl,
    write('     (TUTORIAL: możesz odpowiadać na pytania PRAWDZIWIE (p), FAŁSZYWIE (f) lub WYMIJAJĄCO (w))'), nl,
    write('     (Możesz odpowiedzieć mężczyźnie za pomocą "odpowiedz(<cel>, <odpowiedź>))'), nl,
    assert(can_answer(mezczyzna, sznupanie)), !, nl.

% KOMINEK - NIC CIEKAWEGO
spojrz(kominek) :-
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣦⣀⠀⠀⠀⠀⠀⠀⢲⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⡆⠀⠀⠀⠀⠀⠀⠀⠛⣦⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣿⣷⣤⠀⠀⠀⠀⠀⢻⣿⣷⣄⢀⠀⠀⠀⠀⠀⠀⢀⣴⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢻⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⣷⣄⠀⠀⠀⠀⣿⣿⣿⣷⠱⣆⠀⠀⠀⢀⣾⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣽⣿⡆⠀⠀⠀⢸⣿⣞⣿⣧⢸⣷⣤⠀⢸⣿⣯⣿⠆⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⡟⢰⣿⡷⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀⠀⣿⣦⡄⠀⠀⠀⠀⢻⣿⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣟⣾⣿⠀⠀⠀⣼⣿⡏⣿⣿⠀⣿⣿⣗⠺⣿⣳⣿⣧⠀⠀⠀⠀⠀⠀⠀⣴⣿⡟⠀⣸⣿⡟⣽⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣆⠀⠀⠀⠀⣿⣿⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣦⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⣯⢿⣿⡇⠀⣰⣿⡿⢸⣿⡿⠀⣼⣿⣻⡦⣿⣯⢿⣿⡆⠀⠀⠀⠀⢀⣾⣿⣿⠀⢠⣿⡿⢱⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⢯⣿⠀⠀⢠⠀⣼⣿⣻⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣷⡀⠀⠀⠀⠀⠀⣰⣿⣿⣞⣿⣿⠃⢀⣿⡿⣡⣿⡿⠃⢀⣿⣿⣽⣷⢹⣿⣻⢿⣿⡄⠀⠀⢀⣾⣿⢿⡇⠀⣾⣿⣱⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⠁⢀⡿⢰⣿⣣⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⡄⠀⠀⠀⢰⣿⣿⣻⣼⣿⡿⠀⢸⣿⢣⣿⡿⠁⣠⣿⣿⡟⣾⣿⢈⣿⣯⣟⣿⣷⠀⠀⣸⣿⣟⣿⡇⠀⣿⣧⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣳⣿⡟⠀⣾⡇⢸⣷⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⡄⠀⢠⣿⣿⢯⣳⣿⣿⣦⣄⠘⣿⣿⡿⠁⣴⣿⣿⢯⣽⣿⡟⢀⣿⣷⢯⣿⣿⡇⠀⣿⣿⣽⣻⣿⠀⣿⣷⣿⠇⠀⠀⠀⠀⣀⠀⠀⢀⣼⣿⣿⣳⢿⣿⠁⣰⣿⣇⢸⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⣠⡾⠁⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⢠⣾⠇⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⢿⣷⠀⣿⣿⢯⣟⣼⣿⡇⢻⣿⣧⠘⣿⠃⣼⣿⡿⡽⣞⣿⣿⠁⢸⣿⣟⣮⢿⣿⡇⠀⣿⣿⢶⣻⣿⣇⠘⣿⣿⠀⠀⢀⣴⡿⠁⠀⣠⣿⢱⣿⣯⣽⣻⣿⠀⣿⡿⣿⡄⢻⣧⠀⠀⠀⠀⠀⠀⣴⣾⡟⠁⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⣰⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⢿⡇⢰⣿⣯⡟⣼⣿⣿⠁⠘⣿⣽⣧⠈⢰⣿⣯⡷⣛⣿⣿⠃⠀⣼⣿⣿⢼⣻⣿⡇⠀⢺⣿⡿⣼⣻⣿⣦⠘⠇⠀⣠⣿⡿⠁⠀⣰⣿⡟⢸⣿⣳⢾⡽⣿⣇⢸⣿⡿⣿⣆⠙⠀⠀⠀⠀⢀⣾⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⢀⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⣼⣿⡿⣿⠃⣿⣟⣾⢡⡿⣿⡟⠀⠀⢿⣯⢿⡇⣼⣿⣞⡇⣿⣿⣯⠀⣼⣿⣿⠏⣾⣿⣟⣰⡇⠘⣿⣿⣳⣭⢿⣿⣧⠀⢠⣿⣿⡃⠀⢰⣿⡿⡇⠸⣿⣯⡇⢻⣿⣿⣯⣿⣿⣿⣿⣷⡀⠀⠀⢀⣿⣿⣻⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠐⣿⣯⣿⣇⠱⣆⡀⠀⠀⠀⣸⣿⡿⣽⡿⢸⣿⢯⡇⢸⣟⣯⣟⠀⠀⣻⣿⣻⣿⢼⣷⣻⠄⢸⣿⣿⣿⣿⡿⠏⣸⣿⣿⣷⣿⡅⠀⢸⣿⣷⣏⣾⣻⣿⡆⢸⣿⢿⡅⠀⣾⣿⣻⣿⠐⣿⣿⣻⡄⠻⣽⣿⣯⣿⣷⣻⢿⣿⡆⠀⢸⣿⣟⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠈⣧⡀⠀⢻⣿⣾⣿⣆⠹⣿⣆⠀⢠⣿⣿⡽⣿⡇⢸⣿⢯⡇⢸⣯⢿⣿⡀⣠⣿⣟⡷⣿⢸⣿⡽⣇⠀⡹⠾⠟⠋⢀⣾⣿⣿⣻⣿⢿⡆⠀⢈⣿⣿⢾⡘⣷⣻⣷⣸⣿⢿⣧⠀⣿⣿⣽⣿⡆⠘⣿⣿⣽⡀⢹⡾⣿⣯⢻⣿⣯⢿⣿⡄⢸⣿⣯⢿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('⠀⠀⠀⣿⣷⡀⠸⣿⣷⣻⣿⡀⣿⣿⡧⢼⣿⢷⣻⣿⡇⢹⣿⣟⡆⠈⣿⣻⢿⣷⣿⡿⣭⣿⡟⠘⣿⣟⣯⠀⠐⡀⢂⢠⣿⣿⣿⠍⣿⣿⢿⣿⣦⣼⣿⣟⣾⠇⢹⣯⢿⡏⣿⡿⣿⡀⢺⣿⣞⣿⣿⣦⣹⣿⣯⠇⠀⣿⣻⣿⠀⣿⣯⣟⣿⣷⠈⣿⣿⢯⡿⣿⣧⡀⠀⠀⠀⢀⣀⣤'), nl,
    write('⠀⠀⠀⣿⣿⣇⠀⣿⣷⣻⣿⡇⢹⣯⣿⣼⣿⡇⣿⣿⡇⠘⣿⣯⡗⠀⢜⢯⡿⡽⣯⢷⣯⣿⡷⢨⣿⣟⣾⠀⡼⠁⡌⣾⣿⣿⡏⠀⣿⣿⢯⡿⣿⣟⣿⡽⣾⠀⠐⣯⣿⣟⢿⣿⢿⣷⡜⣿⣯⠺⣟⡿⣿⣟⡿⡀⠀⡿⣽⣿⠀⣿⣿⢞⣿⡟⣲⡿⢻⣿⣳⢟⣿⣿⡄⠀⣴⣿⣿⠃'), nl,
    write('⠀⠀⣼⣿⣯⡇⣼⣿⢷⣻⣿⠀⣽⡿⣽⣿⣿⣽⢸⣿⣿⣤⣿⣯⡟⢧⠈⢢⡙⡿⠁⣾⢿⣿⡇⢸⣿⣟⣾⠰⡇⣸⠱⣟⣿⣷⡀⠀⣿⣿⣳⢻⡽⣿⡳⣽⢣⠇⢈⡷⣿⣏⠸⣿⣯⢿⣿⡹⣿⣷⡈⠙⠳⠟⠐⠀⠀⣿⣿⣇⣼⣿⣯⢿⣿⣷⣿⡇⠘⣿⣯⡛⣾⣿⣟⢰⣿⢿⡟⠀'), nl,
    write('⠀⣼⣿⣿⣿⣽⣿⡿⣫⣿⡇⢰⣿⣟⣿⡏⣿⣿⣆⠹⢿⡿⣟⣷⡻⢸⡄⠀⢻⠃⠀⣿⣿⣿⣀⣾⣿⣽⡎⢸⠁⡏⠀⣿⣻⣿⣿⣾⣿⡿⣽⠃⢻⡷⣽⢋⡎⠀⣴⡿⣿⡿⢀⣿⣟⢺⣿⣧⠹⣿⣿⣄⠀⠙⡆⠀⠀⣿⣿⣿⣿⡟⣾⣿⣿⣿⡽⣇⠀⣹⣿⣽⠸⣿⣿⢨⣿⣿⣷⠀'), nl,
    write('⣼⣿⣟⣿⣿⣿⣿⢃⣿⣿⣷⣿⣿⢞⣿⡇⢸⣿⣽⡄⠠⡙⢿⣯⡗⢨⠀⠀⡘⠰⡰⠘⣿⢿⣿⢿⣻⡞⠁⡾⠀⢱⡐⠈⠷⣯⣟⣯⣟⡽⢏⠀⢨⡿⢁⡞⠀⢰⣿⣿⣿⠃⢈⣿⣿⡃⣿⣿⠄⢻⣿⣽⠀⠀⢧⡀⡆⢹⣾⡽⠃⣾⣿⡿⢸⣿⣽⣿⣦⣿⣿⡏⢘⣷⣿⢸⣿⢿⣿⡄'), nl,
    write('⣿⣿⢽⣿⣿⣿⢾⠀⢿⣻⢿⣯⠏⣾⣿⡇⠘⣿⣯⢿⠀⠙⣆⠹⠇⣤⠇⡄⡃⠀⡇⠀⢈⠙⠙⢋⡁⠀⠠⢹⠀⣄⠑⡌⠀⡀⠉⡈⢀⣰⡾⠀⣼⣣⠋⠇⡀⢺⣯⣿⡟⠀⢀⣿⣟⡇⣿⣿⡇⢸⣿⣾⠁⡆⢸⡇⢸⠈⡻⠀⢸⣟⣿⡇⠸⣿⣷⠻⣿⣿⠟⠀⣸⣿⣿⣾⣿⢯⣿⡧'), nl,
    write('⣿⣿⢸⣿⣿⣿⣻⡇⠈⠻⣿⠁⠨⡷⣿⣷⣤⣽⣿⣻⠅⠀⠘⡆⣸⠏⡰⠀⡇⡄⠘⡄⠂⠈⢀⠀⠲⣀⠀⣽⠀⡈⡦⡈⠢⢑⠀⣴⠞⢁⡠⢀⡽⠁⢸⠀⠀⢹⣿⣿⡇⢀⣾⣿⣿⠁⢿⣽⣿⣿⣿⠟⢠⠃⡘⢧⠈⢫⠀⠀⠸⣯⣿⣷⣤⣿⣿⡇⠘⣋⠆⢠⣿⣿⣿⣿⠏⣾⣿⡇'), nl,
    write('⠹⣿⣧⠻⣿⢿⣷⣻⣄⠘⣄⠀⢀⠿⣽⣻⢿⡿⣯⠟⠀⠀⠀⡼⠃⣴⠇⣸⠁⢸⢂⠘⢔⠀⡀⠀⡄⠻⣄⠘⣇⢡⠀⡉⠢⡀⠉⠁⡔⠋⠁⠨⠁⢀⢾⡀⠆⠘⣷⢿⣿⣿⣿⡿⠃⠀⢊⢉⡛⠋⠁⡠⠃⢠⠃⡘⠠⡀⢷⡀⡀⠻⢽⣿⣿⣿⠟⠀⠐⠁⣠⠿⠿⠛⠋⢁⣰⣿⣿⠁'), nl,
    write('⠀⠹⣿⣷⣌⡙⠛⠽⠷⢧⡈⠢⣄⠲⢍⡛⠳⠛⠁⢊⣠⠞⠋⣰⡟⢁⣴⠇⢀⠂⣦⣉⠢⢄⡑⠄⠈⣶⢄⣁⠙⠤⡂⠹⢦⣈⠓⠈⢠⡶⣼⡄⡶⣹⣧⣳⡘⠰⢌⡛⠚⢓⢫⠴⠁⠀⠈⠁⠀⢐⡭⠔⢒⡇⢠⣇⢠⣆⠈⣷⣈⠢⢄⡠⢉⠀⠀⣀⠄⠘⠁⠀⠀⣠⣴⡿⣿⡿⠋⠀'), nl,
    write('⠀⠀⠈⠙⠿⢽⣷⣶⣤⣤⣌⣦⣈⣳⣶⣤⣤⣴⣠⣭⣴⣶⣛⣧⣴⣾⣩⣴⣾⣧⣝⣯⣷⣶⣭⣗⣤⣈⣛⣶⣭⣝⣃⣂⣀⣉⣻⣦⣔⣿⣮⣅⣁⣻⣾⣽⣻⣧⣤⣥⣤⣠⣄⣤⣠⣤⣤⣴⣶⣯⣤⣶⣯⣴⣟⣿⣮⣟⣷⣮⣟⣿⣶⣶⣖⣶⣾⣥⣖⣶⣲⣮⣷⠿⠞⠋⠁⠀⠀⠀'), nl,
    write('⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠁⠀⠁⠀⠀⠀⠀⠀⠁⠀⠀⠀⠁⠀⠀⠀⠁⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠁⠈⠀⠀⠀⠁⠈⠀⠁⠀⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'), nl,
    write('Ogień w kominku mocno się pali, drewno musiało być dodane niedawno, całkiem tu gorąco.'), !, nl, nl.

% BACA - INTRODUCTION

spojrz(mezczyzna) :-
    answered(mezczyzna, sznupanie, p),
    write('"Warszawiak w górach? W taką pogodę? Zaskakjące... w każdym razie witoj w moim schronisku, jestem Baca.'), nl, fail.

spojrz(mezczyzna) :-
    answered(mezczyzna, sznupanie, f),
    write('"Na drzewach może się nie znosz, ale widzę, że dałeś radę nas ugościć.. i to w taką pogodę. Jestem Baca, witom."'), nl, fail.

spojrz(mezczyzna) :-
    answered(mezczyzna, sznupanie, w),
    write('"Witoj, jestem Baca. Rozgość się..."'), nl, fail.

spojrz(mezczyzna) :-
    \+ answered(mezczyzna, sznupanie, _),
    write('"Ło, prawie cię nie zauważyłem. Jestem Baca, witoj w moim schronisku"'), nl, fail.

spojrz(mezczyzna) :-
    nl,
    write('Baca jest starszym mężczyzną o długich, ciemnych włosach, jego sylwetka jest wyjątkowo muskularna jak na jego wiek. Musi tu ciężko pracować.'),
    !, nl.

% RECEPCJA - ZAKOŃCZENIE WSTĘPU (+ tutorial odpowiadania tak/nie)

% Odpowiedzieliśmy nie - teraz możemy wrócić do karoliny i natychmiast skończyć intro

spojrz(okienko) :-
    can_answer(karolina, pokoj),
    write('"To jak? idziemy?" (odpowiedz na pytanie Karoliny za pomocą t lub n)'), !, nl.

spojrz(okienko) :-
    answered(karolina, pokoj, n),
    endintro, !, nl.

% Karolina introduction
spojrz(okienko) :-
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▒▒▓▓▓▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▒▒▓▓▓█████████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▒▒░▒▒▒▓▒▓░▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓▓▓▒▓█▓▓▓▓████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▒▓▓█▓▓▓███████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▓▒▓▓▒▒▒▒▒▒▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓▓▓▓▓█▓█▓████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓▒░▒▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▒▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒░▒▒▒▒▒▒▒▓▓░░░░░░▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▒▓███▓████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒░░░░░░░▒▒▒▒▒▒▒▒░░░▒▒▒▒▓▓▓███▓▓███████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒░▓▒▒░ ░▒░░░▒▒▒▒▒▒░░░▒▒▒▒▓▓▒▓▓▓█▓▓███████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▓▓▒▒▒▒░░▓▓▒▒▓▓▒▓▓▓██▓███████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▒▒▒▒▒▒▓▓▓▓▓▓▒▓██▓█▓██████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▒▒▒▓██▓▓▓▓▒▒▒▓▓▓▓▓▓▓▒▓██████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓██▓▓▓▓▓▓▓▓▓▓▓▒▓▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓███▓▒▒▓▓▓▓▓▓▓▒▒█▓▓██████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓█▒▒▒▓▓▓▓▓▒▒▓▓▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▒▒▓▓▓▒▒▒█▓████████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▒▓▓▓█████████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒░▒▒▒▒▒▒░░░░░▒▒▒▒▒░▒▓▓▓▓▒▒▓▓██████████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▓▒▒▒▒▒▒░░▒▒▒▒▒▒░░░▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓██▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒░░░▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓█████████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▒▓▓▓▓▓▓▓▓▒▓▓▓▓▓▓███████████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒ ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▒▓▓▓▒▒░░░░░░▒███████████████████████████████'), nl,
    write('▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒░  ▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒░░░░░░░░░░████████████████████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒░      ▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▒▒░  ░░ ░▓▒░░░░░░░░▒▒▒▓████████████████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒             ▒▓▓░░▒▒▒▒▒▒▒▒▒▒▒░        ░░░░░░░░░░░░░░░░▒▒▒█████████████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒                                        ░  ░ ░░░░░░░░░░░░░▒▒▒▒▒██████████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒                                               ░ ░░░░░░░░░░░░▒▒░▒▒▒▒████████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓▓▓                                             ░   ░░░░░░░░░░░░░░░░░░░░▒▒▒███████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓▓                                                     ░░░░░░░ ░░░░░░░░▒▒░▒▒▒██████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓▓                                                    ░░░░░░░░░░░░░░░░░░░░░░▒▒▒█████████████'), nl,
    write('▒▓▓▓▓▓▓▓▓                                                   ░░░░░░░░░░░░░░░▒░░░░░░░▒▒▒▒▒█████▓██████'), nl,
    write('▒▓▓▓▓▓▓▓                                                    ░ ░ ░░░░░░░░░░░░░░░▒░░░░▒▒▒▒▒███████████'), nl,
    write('▒▓▓▓▓▒▒░                                                      ░░ ░░░░░ ░░ ░░░░░░░░░░░▒▒▒░▒██████████'), nl,
    write('▒▓▓▓▒▒▒                                                   ░  ░ ░ ░░░ ░░░░░░░▒░░▒░░░░░░░▒░░██████████'), nl,
    write('▒▒▓▓▓▒                                                         ░░  ░ ░░░░░░ ░░░░░░░░░▒▒▒░░▒█████████'), nl,
    write('▒▒▓▒▒▒                                                      ░  ░  ░    ░░░░░░░░░░░░░░░░░░░▒█████████'), nl,
    write('▒▒▒▒▒                                                  ░ ░      ░░    ░░░ ░░░░░░░░░░░░░▒░░░▒████████'), nl,
    write('▒▒▒▒                                                      ░░ ░░ ░░░   ░░░░░░░░░░▒░░░░░░▒░░░▒████████'), nl, nl,
    write('"Hej! Jestem Karolina!" - słyszysz głos zza okienka'), nl,
    write('"Kuchnię niestety mamy już zamkniętą... ale pewnie chciałbyś wziąć pokój na noc?"'), nl,
    write('"z resztą co ja gadam... w takich warunkach nikt normalny nie wracałby do miasta...'), nl, nl,
    write('Słyszysz brzdęk kluczy...'), nl,
    write('"Proszę! numer 32! "'), nl,
    write('"Mamy dzisiaj tylko jednego innego gościa - więc powinieneś mieć spokojną noc!"'), nl,
    write('"Dziękuję" - odpowiadasz i zabierasz klucz'), nl,
    write('"Pokazać ci jak dojść do pokoju? Czy chcesz jeszcze się rozejrzeć?" (t - skończ intro, n - zostań)'), nl,
    assert(can_answer(karolina, pokoj)), !, nl.

spojrz(kompot) :-
    retract(can_see(kompot)),
    start_story2, !.

spojrz(obiekt) :-
    retract(can_see(obiekt)),
    spojrz(cialo),
    start_story3, !.

spojrz(cialo) :-
    write('▓▓█▓  █▓▓▓█ ▓▒▒▒  ▓█▓▓▓▓▓░░░░░▒▒▒▒▒▒▒▒░▒▒▒▒░░░▒▒▒░▒▒▒▒▒▒░▒▒░░░░ ░░░▒▒▒▒▒░░▒▒░▒▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒'), nl,
    write('▓██▓█ ▒▓▓░░    ▓▒░█▓█▒░░▒░░▒░░░░░░░░░▒▒▒▒▒▒░░░▒░░█░░▓▓▒░░░░░░░░░░░░░░▒▒▒░░░░░░░░▒▓░░░░░░░░░░░░░░▒░░░'), nl,
    write('▒░██ ░     ▓▓▓▓▓▓▒ ▒░░░░░░░░░░░░░░░░░░░▒▒▒▒░░██████░░░▒░░░░░░░░░░░░░░  ░░░░░░░▒▒▒░░▒▒▒░░▒▒░▒░░░░░░░░'), nl,
    write('▓      █▓▓▓▓▓░▒▒▒▒ ░▒░ ░▒░░░░░░░░░░░░▒░▒▒██████████▒▒░░░░▒ ░       ░░░░░░░░░░░░░▒░▒░▒░░░▒▒▒░░░░ ░░▒▒'), nl,
    write('   ▓▓▓▓▓▓▒▒░░░▒░░░░░░░░░░▒░░░░░░░░░░░░░█████████▒▒░░░░░░░░░ ░░░░░░░░░░░░░░░░░░░▒░▒▒░▒░░▒░▒░░░░░░░░░░'), nl,
    write('▓▓▓▓▓▓▒░▒░░░░▒▒▒░░░░░ ░░░▒░░░░░░░░░░░░░▓█████████████▓█░░░░░▒▒░░ ░    ░░░░░  ░░░░▒▒▒░░░░░░▒▒░▒▒░░░░░'), nl,
    write('▓▓▒▒▒▒▒▒▒▒░░░▒░░░░░░ ░░░▒░░▒▒░░░░░░░░░░▒▒████████████████████ ▒░░░░     ░░░░░░░░░▒░░░░░░░▒▒░▒░░░▒▒▒░'), nl,
    write('▒▒▒▒▒▒▒▒▒░░░░▒░░░░░░ ░░░▒░░▒░▒░░░░░░░░░░░░██▓████████████████▓░ ░  ░ ░ ░▒░░░░░░░░░░░░░░░░░░░░░▒▒░▒▒▒'), nl,
    write('░░░░░░░░░  ░░░▒░░░░ ░░░░░░▒▒░░░░░░░░░ ░  ▒████████████████████▓▒░  ▒░░░░▒ ░░░░░░░░ ░▒░░▒░░░░░░░▒▒░▒▒'), nl,
    write('░░░░░░░░░░░░░░░░░░░░░░░▒░░▒▒░░░░░▒██████   ██████████████████████▓▓▓▓░▒▒░░░░░░░░░░░░ ░░░░░░░░░░▒░░░▒'), nl,
    write('░░░░░░░░░░░░░░░░░░ ░░░░░░░▒▒░░████████████ ████████████████████████▓▓▒▓░░░░░░░░░░░░░░░░░░░░░░░░░▒░░░'), nl,
    write('▒░░░░░░▒▒▒░░░░░░░░░░░░░░░▒▒░██████████████  ████████████████████████░    ░░░░░ ░░░░░▒░░░░░░░░░░░▒░░░'), nl,
    write('░░░░░░░░░░▒░░░░░░░░░░░▒░░▒░████████████████  █████████████████████████░  ░░░░░ ░░░ ░░░░░░▒  ░░░░░░░░'), nl,
    write('▒▒▒░▒▒░▒▒░░░░▒▒▒▒▒░░▒░░░▒▒██████████████████ ████████████████████████████░ ░░░░░░░░░░░  ░░░▒░░░░░░░░'), nl,
    write('▒░░▒▒░░░░░░░░░░░      ░▒▒▒███████████████████████████████████████████████████░░░░███████▒▒░░░░░░░░ ░'), nl,
    write('░░░▒░▒░▒▒░░░░▒░░░░░░░░░░░░▒████████████████████████████████▒░▒▒██████████████████████▓░░░░  ░░░░░░ ░'), nl,
    write('░░ ░░░░░░░░░░░░░░░░░░░ ▒░▓▒███████████████████████████  ░       ░  ░████████████████▒░▒▒░░▒░░░░░░░░░'), nl,
    write('░ ░░░░░░░░░░░░░░░░ ░░▒░▒▒▒▓▓▓█████████████████████  ░░░  ░░  ░     ░  ░░▒▒██████░░░░░░░░▒░░░░░░░░░░░'), nl,
    write(' ░░░░░░░░░░░░░░░░░░░░░▒░▒▒▓▓▓▓████████████████████░▒▒ ░░░░░ ░ ░  ░░ ░     ░ ░░░░░░░░░░░░▒░░░░░░░░░░░'), nl,
    write('▒░▒▒░░░░░░░░░░░░░░░░░░▒▒▒▒▒▓▓▓███████████████████████░░░░░░░░ ░░░ ░░░░░░░ ░░░░░░░░░░░░░░▒░░░░░░░░░░░'), nl,
    write('░░░░░░░░▒░░░░ ░░░░░░░░░▒▒▒▒▒▓▓▓██████████████████████████░░░░░░░░░░░░ ░░░░░░░  ░░░░░░░░░▒░░▒░░░░░░░░'), nl,
    write('░░░ ░░░▒  ░░░░░░░░▒▒▒░░░░▒▒▓▒▓▓▓████████████████████████████░░░░  ░░░░░░░░░░░░░░░░░░ ▒░░░░░▒▒░░░░░░░'), nl,
    write('░░░░░ ░░ ░░  ░░░░░▒░░░░▒░▒▒▒▒▒█▓███████████████████████████████░░░░ ░░░░░░░░░░░░░░░ ░▒░░░░▒░▒░░░░░░░'), nl,
    write('░░░░░░▒  ░░░░░▒░░░  ░ ░    ░░▒▒▓▓███████████████████████████████░ ░ ░░░░░░▒ ░ ░░░ ░░░░░░░░▒░░░░░░░░░'), nl,
    write('░░░░░░░ ░░  ░░░░░ ░░ ░ ░░ ░░░░▒▒▓▓██████████▓▓███████████████████   ░ ░░░░░░░░   ░░░░░░░▒▒░▒░░▒░░░░░'), nl,
    write('░░░░░░░░░░░▒░░░░░░░░░░░░░ ░░░░░▒▒▓██████████▒▒▒▒▒▒▒▓████████████░ ░                ░ ░ ░░░░▒░░▒░░░░░'), nl,
    write(' ░░░░ ░▒░ ░░░░░░ ░▒░░░░░░░░░░░░▒▒████████████ ░░░░▒████████████░░ ░         ░░   ░  ░░░░░░░▒░░░░░░░░'), nl,
    write(' ░░░░▒░░░░░░░   ░░▒░░░░░░░░░░████████████████ ░░░▒████████████ ░ ░   ░░░  ░░░    ░░░▒▒▒░░░░░░░░░▒░▒▒'), nl,
    write('░░░░░░░░░ ░░░░░░▒▒░░░░░░████████████████████   ░████████████▒░ ░░ ░░ ░░ ░░░▒░░░░░░░░░░░░░░░░░░░░░▒▒▒'), nl,
    write('░░░░░░░░░░░░░░ ░░░░████████████████████████░░░░████████████░░░ ░ ░░░░░          ░░░░░░░░░░░░░░░▒▒▒▒▒'), nl,
    write('▒▒░ ░░░░ ░▒▒▒▒▒▒█████████████████████████▓░░░░████████████ ░ ░    ░ ░ ░     ░░        ░░ ░░░░░░░▒▓▒▒'), nl,
    write('░░░ ░░░░▒ ▒▒▒▒▒▓████████████████████████ ░░░█████████████░░░░░      ░           ░      ░░░░░░░░░▒▒▒▒'), nl,
    write('░▒▒░░  ░▒▒▒▒▒▒▒▒▒██████████████████▒▒▒░░░░░████▓▓███████  ░  ░░                 ░░   ░░░░░░░░░░░░▒▒▒'), nl,
    write('▒▒▒▒░▒▒▒▒▒▒▒▒▒▒██▓█████████████▒░░░░░░░░▒▒▒▒▒▒▒████████░░░   ░            ░          ░  ░░░░░░░░░▒▒▒'), nl,
    write('▒▒▒▒▒▒▒▒▒▒▒▒▒░░░░░▒████████▒░░░░░░░░░░░▓▒▒▒▒▒▒▒▒█████░░░  ░░                ░         ░░░░░░░░░░░░▒▒'), nl,
    write('░░░▒▒▒▒▒▒▒▒ ░░░░░ ░░▓██▒░░░▒░░░░░░░░░░░▒▒▒  ▒▒▒░░░░▒   ░░   ░    ░                    ░░░░░ ░░░▒░░░▒'), nl,
    write('▒▒▒▒░▒▒▒▒█▒░░░░░░░  ░░░░░░░▒░░░░░░░░░   ░▒▒▒▒▒░░░ ░      ░                  ░       ░   ░░░░░░░░░░░▒'), nl,
    write('▒░▒▒   ▒▒▒░░░░░░░░░░░░ ░ ░░░░░░░▓░ ░░   ░▓▒▒▒░▒░ ░                ░                 ░ ░   ░░░░░░░░░░'), nl,
    write('▒▒▒▓▒ ▓▒▒▒▒▒░░░░░░ ░░  ░░░░░░░░░▒░ ░  ░░░░▓▒▒▒▒                             ░ ░        ░░  ▒░░░░░░░░'), nl,
    write('▒░▒░░░▒▒░░▒▒░░░░░░░░░ ░░░░░░░░▒░▒░░░ ░ ░░░▒▓▒▒░                                  ░░░ ░ ░░▒ ░░░░░░░░░'), nl,
    write('▒▒▒▒▒░▒▒░▒▒▒▒░░▒░ ░   ░░░░░░▒░░░▒░░░ ░░░ ░▒█▓▒               ░                 ░ ░░░░░ ░░░ ░░░░░░░░░'), nl,
    !, nl.


% !!! UNMATCHED LOOK RULE, MUST BE AFTER OTHER SEE RULES
spojrz(_) :-
    write('Patrzysz się w otchłań marząc o Warszawie'), !, nl.

% answer shortcuts
p :- odpowiedz(_, p).  % prawda
f :- odpowiedz(_, f).  % fałsz
w :- odpowiedz(_, w).  % wymijająco
t :- odpowiedz(_, t).  % tak
n :- odpowiedz(_, n).  % nie

% general answer rules, !!! MUST BE BEFORE OTHER ANSWER RULES
odpowiedz(X, _) :-
    \+ can_answer(X, _),
    write('nie zostało ci zadane pytanie'), !, nl.

% KONWERSACJA Z BACA PO INSPEKCJI STOŁU - ODPOWIEDZI

odpowiedz(mezczyzna, p) :-
    can_answer(mezczyzna, sznupanie),
    write('"Nigdy nie widziałem takiego drzewa proszę pana, jestem z Warszawy" - odpowiadasz'), nl,
    write('Mężczyzna krzywo się na ciebie patrzy i momentalnie odwraca wzrok.'), nl,
    finish_answer(mezczyzna, sznupanie, p), !, nl.

odpowiedz(mezczyzna, f) :-
    can_answer(mezczyzna, sznupanie),
    write('"To dąb? - solidny."'), nl,
    write('"Nie. to sosna" - odpowiada mężczyzna i przewraca oczami'), nl,
    finish_answer(mezczyzna, sznupanie, f), !, nl.

odpowiedz(mezczyzna, w) :-
    can_answer(mezczyzna, sznupanie),
    write('"yyy - ładny kominek."\n"dziękuję." - opowiada mężczyzna'), nl,
    finish_answer(mezczyzna, sznupanie, w), !, nl.

odpowiedz(karolina, t) :-
    can_answer(karolina, pokoj),
    finish_answer(karolina, pokoj, t),
    write('"Chodź za mną."'), nl,
    endintro, !, nl.

odpowiedz(karolina, n) :-
    can_answer(karolina, pokoj),
    write('"Spoko, podejdź do okienka jak będziesz gotowy"'), nl,
    finish_answer(karolina, pokoj, t), !, nl.

% !!! GENERAL ANSWER RULE, MUST BE AFTER OTHER ANSWER RULES
odpowiedz(_, _) :-
    write('nie możesz tak odpowiedzieć!'), !, nl.

finish_answer(Who, Question, Answer) :-
    retract(can_answer(Who, Question)),
    assert(answered(Who, Question, Answer)), !, nl.

endintro :-
    tty_clear,
    retractall(can_see(_)),
    retractall(can_answer(_)),
    retractall(answered(_)),
    write('Karolina zaprowadziła cię do swojego pokoju.'), nl, nl,
    write('Rzuciłeś plecak na łóżko.'), nl,
    write('Padasz ze zmęczenia, kładziesz się w łóżku i natychmiast zasypiasz...'), nl, nl,
    write('HINT: użyj słowa \e[1mstart_story\e[0m aby rozpocząć następny rozdział...'),
    retract(at_introduction),
    !, nl.

start_story :-
    tty_clear,
    \+ at_introduction,
    write('Budzisz się. Spoglądasz w zegarek. 1:12.'), nl,
    write('Czujesz suchość w ustach, zmęczenie po przyjściu do schroniska spowodowało, że zapomniałeś, że od dawna nic już nie piłeś...'), nl,
    write('Przypominasz sobie, że na stole w holu schroniska stał \e[1mkompot\e[0m. Nie możesz przestać o nim myśleć.'), nl,
    write('Czujesz, że nie będzie to łatwa noc.'), nl,
    assert(can_see(kompot)), !, nl.

start_story2 :-
    write('Powoli schodzisz schodami w dół... mimo to, słyszysz ciche skrzypienie'), nl,
    write('Wchodzisz do holu... kątem oka zauważasz dziwny, spory \e[1mobiekt\e[0m na ziemii. Byłby całkowicie niewidoczny, gdyby nie kominek'),
    write(', który, dopalając się, lekko go oświetlał') , nl,
    write('Zauważasz też, że podłoga, po której chodzisz lekko się lepi... "i tyle zostało z kompotu..." - pomyślałeś'), nl,
    assert(can_see(cialo)),
    assert(can_see(obiekt)), !, nl.

start_story3 :-
    write('Zbliżasz się do dziwngo obiektu... teraz widzisz, że jest to... Karolina, która z zamkniętymi oczami leży na ziemi, otoczona jest plamą ciemnoczerwonego płynu... krew.'), nl,
    write('Jesteś zszokowany. Mimowolnie zaczynasz wycofywać się, ale przypadkowo uderzasz w stół, strącając z niego szklankę...'), nl,
    write('Szklanka upada na ziemię natychmiast rozbijając się, przeszywając całe schronisko głośnym hukiem.'), !, nl.

